[{"id":1,"headline":"Mt. Hood&rsquo;s melting glaciers","link":"https://mpfriesen.github.io/hood-glaciers/","linkhead":"Mt. Hood&rsquo;s melting glaciers","category":"Maps","published":"May 2022","desc":"Class project for Geography 778, University of Wisconsin-Madison. Glaciers on Oregon's Mt. Hood have been receding for decades, yet official maps still show glacier extents first drawn in the mid-1950s. This project is an attempt to approximate current glacier extents using recent aerial imagery, USGS Digital Elevation Models and satellite imagery from Landsat and Sentinel data.","tools":"QGIS, Mapbox, Photoshop, HTML, CSS, JQuery","outlet":"Class project, UW-Madison","img_slug":"hood"},
{"id":2,"headline":"Heat islands","link":"https://www.oregonlive.com/weather/2021/07/oregons-deadly-heat-there-will-be-a-next-time.html","linkhead":"Oregon&rsquo;s deadly heat: &lsquo;There will be a next time&rsquo;","category":"Maps","published":"July 2021","desc":"An unprecedented heat wave in the Pacific Northwest in June 2021 drove temperatures in Portland to 116 and killed more than 100 people statewide. These maps show the heat-island effect and the Urban Heat Index in Portland by Census tract and how it compares to median income.","tools":"QGIS, Photoshop, Illustrator","outlet":"The Oregonian","img_slug":"heat"},
{"id":3,"headline":"Property tax lookup","link":"https://projects.oregonlive.com/data-points/taxes/property","linkhead":"Look up your property taxes","category":"Map","published":"November 2021","desc":"Property taxes in Oregon are collected based on a system adopted in the 1990s that limited property taxes by disconnecting assessed value from real market value. The map shows the relationship between the assessed value of each single-family residential property to its market value and allows users to search for their address.","tools":"Mapbox, PHP, PostgreSQL, QGIS, HTML, CSS, JQuery","outlet":"The Oregonian","img_slug":"property"},
{"id":4,"headline":"Portland shootings map","link":"https://projects.oregonlive.com/data-points/shootings/lookup","linkhead":"Find shootings near you","category":"Map","published":"October 2021","desc":"A map showing shootings in Portland, which have spiked to record levels in the past two years. This map allows users to enter an address and find out how many shootings there have been in a quarter-mile radius.","tools":"HTML, CSS, Mapbox, Turf.js, JQuery","outlet":"The Oregonian","img_slug":"shootings"},
{"id":5,"headline":"Wildfire map","link":"https://projects.oregonlive.com/wildfires/map/","linkhead":"Wildfire tracker","category":"Map","published":"2015-present","desc":"This map tracks wildfires in Oregon and the rest of the U.S., including drought conditions and evacuation zones. ","tools":"Python, PostgreSQL, Leaflet,","outlet":"The Oregonian","img_slug":"wildfires"},
{"id":6,"headline":"Poems for the Pandemic","link":"https://projects.oregonlive.com/kim-stafford/","linkhead":"Poems for the Pandemic","category":"Digital design","published":"April 2020","desc":"In the first grim, locked-down weeks of the 2020 pandemic shutdown, Oregon poet laureate Kim Stafford wrote poetry that reflected the crisis. Oregonian photographer Beth Nakamura and videographer Brooke Herbert created photographs and videos in response. ","tools":"HTML, CSS, JQuery","outlet":"The Oregonian","img_slug":"poems"},
{"id":7,"headline":"Covid-19 data pages","link":"https://projects.oregonlive.com/coronavirus/","linkhead":"Coronavirus at a glance","category":"Maps, graphics","published":"2020-present","desc":"We first launched a page tracking Oregon Covid data in early March 2020. It expanded and changed over time, eventually including pages tracking numbers by county and ZIP code using data from many sources, including the Oregon Health Authority, Centers for Disease Control, Johns Hopkins, The Atlantic's COVID Tracking Project and The New York Times.","tools":"D3, Python, Pandas, PostgreSQL, HTML, CSS, JQuery","outlet":"The Oregonian","img_slug":"covid"},
{"id":8,"headline":"Portland gun violence","link":"https://projects.oregonlive.com/under-the-gun/","linkhead":"Under the Gun","category":"Digital design","published":"October 2021","desc":"A long-form feature on the record-high levels of gun violence in Portland.","tools":"HTML, CSS, JQuery","outlet":"The Oregonian","img_slug":"undergun"},
{"id":9,"headline":"Election results","link":"https://gov.oregonlive.com/election/2020/general/legislature/","linkhead":"Oregon election results","category":"Maps, graphics, database","published":"2010-present","desc":"Real-time election results and maps for Oregon primaries and general elections. I created a backend system in 2010 using PHP and MySQL to allow a team to input election results from Oregon's 36 counties and pushing them live to our site within minutes, often outpacing the AP's results. The system allowed us to call races (and automatically tweet those calls) on our own based on the current results and our own staff knowledge of the political landscape, again usually outpacing AP. Currently building a new Python-based system that takes advantage of a live data feed from the Secretary of State.","tools":"PHP, Python, MySQL, JQuery, D3, PostgreSQL","outlet":"The Oregonian","img_slug":"election"},
{"id":10,"headline":"2018 governor election maps","link":"https://gov.oregonlive.com/election/2018/general/precincts/governor/","linkhead":"2018 governor results in 5 maps","category":"Maps","published":"December 2018","desc":"Oregon Democratic Gov. Kate Brown defeated Republican Knute Buehler 50.1 percent to 43.7 percent statewide in the Nov. 6, 2018, general election. Official precinct-level results  let us take a deeper look into the race. So here are five maps that explore the results.","tools":"Leaflet, Tilemill, QGIS","outlet":"The Oregonian","img_slug":"govmaps"},
{"id":11,"headline":"Property tax winners and losers","link":"https://projects.oregonlive.com/taxes/property/map/","linkhead":"Measure 50 winners and losers","category":"Map","published":"September 2015","desc":"Oregon homeowners used to pay taxes based on what their property was worth. That connection ended in 1997 when voters limited how much property values could grow each year for tax purposes. Homeowners in slow-growth neighborhoods now routinely pay higher taxes than people with homes of greater value in gentrified areas. We wondered: What would happen if the tax benefits of 1997’s Measure 50 were redistributed based on market value? This interactive lets users look up any Portland metro-area address and see how property taxes would be affected on properties within a quarter-mile radius.","tools":"R, PostgreSQL, PostGIS, QGIS, Tilemill, Leaflet, Javascript, JQuery","outlet":"The Oregonian","img_slug":"tax"},
{"id":12,"headline":"Oregon school vaccination rates","link":"https://projects.oregonlive.com/maps/vaccination/","linkhead":"Oregon school vaccination rates","category":"Map","published":"2015-present","desc":"Vaccination rates for more than 3,200 schools and child-care facilities in Oregon. The rate is determined by the number of students who have received all required vaccinations for their age or grade level. Clicking on a school shows vaccination numbers for specific diseases and where the school stands as far as herd immunity for measles and mumps.","tools":"Leaflet, D3, JQuery, Datatables, QGIS, PostgreSQL","outlet":"The Oregonian","img_slug":"vaccine"},
{"id":13,"headline":"Your Government: Tracking the Oregon Legislature","link":"https://gov.oregonlive.com/","linkhead":"Your Government","category":"Database","published":"2009-present","desc":"This site tracks every bill, every floor vote by every lawmaker and every committee meeting in the Oregon Legislature. Started in 2009 parsing text files the Legislature uploaded to an FTP server every morning and populating a MySQL database. Now uses the Legislature's constantly updated OData API.","tools":"PHP, MySQL, JQuery","outlet":"The Oregonian","img_slug":"gov"},
{"id":14,"headline":"Your Schools: Data on Oregon schools","link":"https://schools.oregonlive.com/","linkhead":"Your Schools","category":"Database","published":"2010-present","desc":"This site displays data from the Oregon Department of Education for every public school and district in the state, including test scores, report cards, demographics and graduation rates.","tools":"PHP, MySQL, JQuery","outlet":"The Oregonian","img_slug":"school"},
{"id":15,"headline":"No Mercy","link":"https://projects.oregonlive.com/no-mercy/","linkhead":"No Mercy","category":"Digital design","published":"October 2019","desc":"A long-form investigative feature about the daughter of the co-founder of Mercy Corps, a huge international relief organization headquartered in Portland, who reported to the organization in the 1990s and again in 2018 that her father had sexually abused her for years but led to no significant changes. This investigation resulted in the resignation of CEO and others in the Mercy Corps leadership. This feature won Online Storytelling Project of the Year in the 2020 <strong>Pictures of the Year</strong> competition.","tools":"HTML, CSS, JQuery","outlet":"The Oregonian","img_slug":"mercy"},
{"id":16,"headline":"Radon","link":"https://projects.oregonlive.com/radon/","linkhead":"Cancer Cloud","category":"Digital design","published":"December 2019","desc":"Long-form investigation about how local housing authorities and the federal government — which has warned homeowners about the dangers of radon for decades — have ignored the danger and disregarded legal mandates from Congress to fix the problems in their properties. This story won a third place <strong>National Headliner Award</strong> for public service.","tools":"HTML, CSS, JQuery","outlet":"The Oregonian","img_slug":"radon"},
{"id":17,"headline":"Quiet Rooms","link":"https://graphics.chicagotribune.com/illinois-seclusion/index.html","linkhead":"Quiet Rooms","category":"Map","published":"November 2019","desc":"In Illinois, it’s legal for school employees to seclude students in a separate space — to put them in “isolated timeout” — if the students pose a safety threat to themselves or others. Yet every school day, workers isolate children for reasons that violate the law, an investigation by the Chicago Tribune and ProPublica Illinois found. The map enables readers to look up a school district and see their seclusion data. This story won a second  place <strong>National Headliner Award</strong> for public service.","tools":"Leaflet, D3, JQuery","outlet":"Freelance, Chicago Tribune","img_slug":"trib"},
{"id":18,"headline":"Portland bike thefts","link":"https://projects.oregonlive.com/maps/bikes/thefts","linkhead":"Portland bike thefts, 2007-2014","category":"Map","published":"February 2015","desc":"The number of bike thefts reported to Portland police doubled between 2007 and 2014. The geographical spread of those thefts, however, stayed fairly constant. Data provided by police includes bikes reported stolen during car thefts and car prowls. Still, areas where bikes are most likely to be parked outside — universities, high schools and shopping centers — explain most of the city’s hot spots. This map won the <a href='https://bestofthewestcontest.org/?page_id=1031'>SPJ 2016 Best of the West Informational Graphic award</a>","tools":"Leaflet, D3, JQuery, QGIS","outlet":"The Oregonian","img_slug":"bike"},
{"id":19,"headline":"Permanent Daylight Time","link":"https://projects.oregonlive.com/interactives/daylight/","linkhead":"Permanent Daylight Time","category":"Interactive","published":"2018","desc":"Here’s when sunrises and sunsets will happen in Portland if the state adopts permanent Daylight-Saving Time. Rolling over the graphic will show you sunrise and sunset times for different dates.","tools":"D3, JQuery","outlet":"The Oregonian","img_slug":"daylight"},
{"id":20,"headline":"Polluted by Money: Interactive intro","link":"https://projects.oregonlive.com/polluted-by-money/intro","linkhead":"Polluted by Money","category":"Interactive","published":"2019","desc":"This is an interactive prologue to a major four-part project examining the affect of Oregon's very lax campaign finance limits on the state's environment. The interactive guides the reader visually through some striking statistics about the scope of money in Oregon politics. This series won a first place <strong>National Headliner Award<strong> for news series, a <strong>Scripps Howard</strong> award for environmental reporting and a <strong>Collier Prize</strong> for State Government Accountability, among other awards.","tools":"D3, JQuery","outlet":"The Oregonian","img_slug":"polluted"},
{"id":21,"headline":"PDX temps","link":"https://projects.oregonlive.com/weather/temps","linkhead":"Portland temps, 1938-2022","category":"Visualization","published":"2016","desc":"The high temperature recorded at Portland International Airport every day since April 1, 1938.","tools":"D3, Python","outlet":"The Oregonian","img_slug":"temps"},
{"id":22,"headline":"Mt. Hood snowpack","link":"https://projects.oregonlive.com/weather/hood-snowpack","linkhead":"Mt. Hood snowpack, 1980-2022","category":"Interactive Visualization","published":"2015","desc":"The daily Snow Water Equivalent (a measure of water contained within the snowpack), from the Mt. Hood SNOTEL site, taken every day since October 1979. ","tools":"D3, Python","outlet":"The Oregonian","img_slug":"snowpack"},
{"id":23,"headline":"U.S. gun ownership and deaths","link":"https://projects.oregonlive.com/ucc-shooting/gun-ownership","linkhead":"U.S. gun ownership and gun deaths","category":"Interactive Visualization","published":"October 2015","desc":"Researchers have established a strong link between gun ownership and gun deaths. The connection is clearest with suicide, but studies also say ownership rates play a statistically significant role in gun homicides. Published in the wake of the 2015 mass shooting at Umpqua Community College in Southern Oregon.","tools":"D3","outlet":"The Oregonian","img_slug":"guns"},
{"id":24,"headline":"Climate ambition bubble chart","link":"https://rmi.org/climate-ambition","linkhead":"Climate ambition bubble chart","category":"Interactive Visualization","published":"December 2021","desc":"Bubble chart showing the climate ambition and market capitalization among various companies in a number of sectors.","tools":"D3","outlet":"Freelance, MG Strategy+Design","img_slug":"bubble"}]